Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཕྱི་ཞིག་ན་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཏུ་ཇི་སྲིད་དགྱེས་པའི་བར་དུ་བཞུགས་ནས་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞམ་རིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་ཀཽ་ཤཱཾ་བཱི་ག་ལ་
en: One day the Blessed One, having stayed in Rājagṛha for as long as he liked, donned his Dharma robes, and, carrying his alms bowl, set out for Kauśāmbī, surrounded and attended by an assembly of monks.

source: བ་དེར་རྒྱུ་ཞིང་གཤེགས་པ་ལས་མཐར་གྱིས་ཀཽ་ཤཱཾ་བཱིར་བྱོན་ཏེ། ཀཽ་ཤཱཾ་བཱི་ན་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ན་བཞུགས་སོ། །
en: He made his way through the countryside until he arrived in Kauśāmbī, where he stayed in the householder Ghoṣila’s garden.

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་བཅོམ་ལྡན་འདས་པད་མའི་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཏེ། ཀཽ་ཤཱཾ་བཱིར་བྱོན་ནས་ཀཽ་ཤཱཾ་བཱི་ན་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །
en: King Udayin of Vatsa heard that the Blessed One was traveling through the country of Vatsa and had arrived in Kauśāmbī, where he was staying in the householder Ghoṣila’s garden.

source: ཐོས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Hearing this, he approached the Blessed One, touched his head to the Blessed One’s feet, and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དོ། །
en: Once King Udayin of Vatsa had taken a seat at one side, the Blessed One instructed, encouraged, inspired, and delighted him with a discourse on the Dharma.

source: ཆོས་ཀྱི་གཏམ་རྣམ་གྲངས་དུ་མས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: After he had instructed, encouraged, inspired, and delighted him with a discourse on the Dharma, he sat without speaking.

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས། བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་གྱི་མཇུག་རྫོགས་པར་རིག་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Knowing that the Blessed One had completed his discourse, King Udayin of Vatsa then rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and said,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པར་དགུང་ཟླ་གསུམ་གྱི་བར་ཏུ་བདག་ལས་ན་བཟའ་དང་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་བཞེས་པར་ཅི་གནང་ཞེས་གསོལ་ཏོ། །
en: “Please permit me to provide the Blessed One and the rest of the saṅgha of monks with provisions of clothing, food, bedding, seats, and medicines for the sick for the three months of winter.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented by his silence.

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བར་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས།
en: Understanding that by his silence the Blessed One had given his assent, King Udayin of Vatsa then provided for all their needs there in the householder Ghoṣila’s garden.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས། ཐ་མའི་ཉིན་པར་བཅོམ་ལྡན་འདས་ལ་ན་བཟའ་འབུམ་རི་བ་ཕུལ་ལོ། །
en: After respectfully providing for all the needs of the Buddha and the rest of the saṅgha of monks for three months, he offered the Blessed One very costly food on the last day.

source: དགེ་སློང་གཞན་དག་ལ་ཡང་རེ་རེ་ལ་རས་ཟུང་རེ་ཕུལ་ནས་སོང་ངོ་། །
en: Then he offered each of the other monks a set of cotton robes, and they departed.

source: དེ་ཡང་དུས་དུས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་ནས་ཆོས་མཉན་པར་བྱེད་དོ། །
en: From time to time he approached the Blessed One to listen to the Dharma.

source: བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་ནས་ལྷག་པར་ཡང་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་འབའ་ཞིག་གི་ཐད་དུ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོ་བར་བྱེད་དོ། །
en: After hearing the Dharma from the Blessed One, he always made a point of going to offer his respectful service to Venerable Piṇḍola­bhāradvāja.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེ་མཐོང་ནས་ཐེ་ཙོམ་སྐྱེས་ཏེ་
en: When the monks saw him, they became suspicious.

source: རྒྱལ་པོ་འདི་ཅིའི་ཕྱིར། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་འབའ་ཞིག་ལ་ལྷག་པར་བཀུར་སྟི་བྱེད་ཞིག་གུ་
en: “Why should this king make a point of going to offer such respectful service to Venerable Piṇḍola­bhāradvāja?”

source: སྙམ་ནས་དེ་དག་གིས་གཏམ་དེ་རྒྱས་པར་ཐོས་སོ། །
en: they wondered. Then they heard the story in detail.

source: ཐོས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: After they heard it, they asked the Blessed One,

source: བཙུན་པ་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་རབ་ཏུ་སྡང་བའི་སེམས་ཀྱིས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་ཐད་དུ་མཆིས་ནས། གཞི་དེས་ན་དེའི་འོད་མ་མཆིས་པར་གྱུར་ཏེ་དོག་ས་ལ་ཡང་དེའུ་ནུབ་པ་ལས། གང་གི་ཚེ་དེས་སླར་སེམས་དགའ་བ་བསྐྱེད་པ་དེའི་ཚེ་འོད་དེ་ཡང་སླར་བྱུང་བར་གྱུར་ལ། དོག་ས་གས་པ་ཡང་སླར་འབྱོར་པར་གྱུར་པ་ལ་གཟིགས་ལགས།
en: “Lord, tell us why King Udayin of Vatsa approached Venerable Piṇḍola­bhāradvāja with spiteful thoughts, which caused his air of splendor to disappear, and just as he was about to fall into a narrow fissure, his mind again became filled with joy and his splendor returned, and the narrow fissure closed up as well.”

source: དགེ་སློང་དག་དེ་ནི་ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ
en: “Not only now, monks,”

source: འདི་ལྟར་འདས་པའི་དུས་ན་ཡང་གྲོང་ཁྱེར་འབྲས་འཕེལ་ཞེས་བྱ་བ་ན་རྒྱལ་པོ་ལྷུན་པོ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “but this happened in times past as well, and in the same way, during King Meru’s reign in the city called Flourishing Rice.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་།
en: The kingdom was prosperous, flourishing, happy, and well populated. The harvest was good.

source: རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་ཆོམ་རྐུན་དང་མུ་གེ་དང་ནད་རྣམས་མེད་པ་དང་།
en: Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine.

source: འབྲས་སཱ་ལུ་དང་བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: Rice, sugarcane, cattle, and buffalo were plentiful.

source: བུ་གཅིག་པ་སྡུག་པ་ལ་བྱ་བ་བཞིན་དུ་ཆོས་བཞིན་དུ་རྒྱལ་སྲིད་བྱེད་དོ། །
en: His was a reign in accord with the Dharma, and he treated the kingdom like a beloved only child.

source: དེ་ནས་རྒྱལ་པོ་དེའི་མདུན་ན་འདོན་དེས། ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་
en: “When the time came for the king’s family priest to marry, he took a wife, and they enjoyed themselves and coupled.

source: ཕྱིས་རེ་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས
en: As they enjoyed themselves and coupled, one day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་བྲམ་ཟེའི་སྤྱོད་ལམ་དང་སྤྱོད་པ་དང་ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་
en: and as he grew up he studied letters, brahminical customs and conduct, the syllables oṁ and bho, ritual purity, ritual actions , the collection of ashes, the holding of the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction.

source: བསླབས་ནས། ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེ། དེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: Trained in these procedures, he became a master of the six types of brahminical activities, and in time he mastered the eighteen sciences.

source: ཕྱི་ཞིག་ན་དེས་བདག་གི་ཕ་ཆོས་དང་། ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་འཛིན་པ་མཐོང་ངོ་། །
en: “He came to see that his father administrated the affairs of the kingdom both righteously and unrighteously.

source: མཐོང་ནས་ཀྱང་དེས་བསམས་པ་
en: Recognizing this he thought,

source: ཕ་ཤི་བའི་འོག་ཏུ་བདག་གི་ཅོད་པན་མེད་པའི་རྒྱལ་སྲིད་འཛིན་པའི་བར་དུ་གྱུར་གྱིས།
en: ‘After my father dies, I shall rule the kingdom without a crown.

source: བདག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་ནགས་འདབ་ཏུ་གནས་བཅའ་བར་བྱའོ་
en: Let me then give up living at home and go to live in the forest.’

source: སྙམ་དུ་བསམས་ནས་ཕ་མ་ལ་གསོལ་ཏེ་ནགས་འདབ་ཏུ་གནས་བཅས་སོ། །
en: Reflecting in this way, he asked for his parents’ permission and went to live in the forest.

source: དེ་དེར་སོང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: There he generated the four meditative states and the five superknowledges.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་རྒྱལ་པོའི་ཕོ་བྲང་འབྲས་འཕེལ་དུ་ཕྱིན་ནས།
en: “One day he went to the royal palace in the city of Flourishing Rice.

source: དེའི་ཕས་བུ་དེའི་ཕྱིར་བདག་གི་སྐྱེད་མོས་ཚལ་དུ་ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་པོ་ཕུབ་ནས་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཏེ།
en: Upon his arrival in the park his father fashioned him a hut of branches and leaves, and began to provide for all his needs.

source: དེ་ལ་དུས་དུས་སུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདོང་ཞིང་ཆོས་ཉན་པར་བྱེད་དོ། །
en: Many people would come from time to time to see him and to listen to the Dharma.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ལྷུན་པོས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བསྐོན་ནས་རི་དགས་ཤོར་དུ་སོང་བ་དང་།
en: “Then one day King Meru arrayed the four divisions of the army and set out to hunt deer.

source: རྒྱལ་པོས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་མདུན་ན་འདོན་གྱི་སྐྱེད་མོས་ཚལ་དུ་འདོང་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་སྐྱེ་བོའི་ཚོགས་འདི་དག་གར་འདོང་ཞེས་དྲིས་སོ། །
en: The king saw many people entering the park, and he asked, ‘Where are all these people going?’

source: བློན་པོ་རྣམས་ཀྱིས་གསོལ་པ།
en: his ministers replied,

source: མདུན་ན་འདོན་གྱི་བུ་དེ་རབ་ཏུ་བྱུང་སྟེ་དེ་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བར་ཡང་གྱུར་ཏེ་
en: ‘the child of the royal family priest not only has gone forth, but is a person of great miracles and great power as well.

source: འདི་དག་ནི་དེ་ལ་བལྟ་བའི་སླད་དུ་མཆི་བ་ལགས་སོ། །
en: They are all going to see him.’

source: དེ་ནས་རྒྱལ་པོས་བསམས་པ།
en: “Thereupon the king thought,

source: དེ་ནི་ང་ཡི་ཡང་སྙིང་དུ་སྡུག་པ་དང་ཡིད་དུ་འོང་བ་དང་། མཁན་པོ་དང་དྲན་པར་བྱ་བ་ཡིན་གྱིས་ང་ཡང་དེ་བལྟ་བའི་ཕྱིར་འགྲོའོ་
en: ‘He pleases me and is dear to my heart, and it is my duty to pay tribute to a preceptor. I will also go and see him.’

source: རྒྱལ་པོ་དེ་དྲང་སྲོང་ག་ལ་བ་དེར་སོང་བ་དང་།
en: The king went to see the sage.

source: དྲང་སྲོང་དེས་དེ་མཐོང་ནས་བསུ་ཡང་མ་བསུ་ལངས་ཀྱང་མ་ལངས་སོ། །
en: But upon seeing the king, the sage did not receive him, nor did he so much as stand.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་ཁྲོ་བ་ཆེན་པོས་ནོན་ནས།
en: “When the king saw this, he was suddenly consumed with fury.

source: འདི་ང་ཡི་ཡུལ་ན་འདུག་པའི་མདུན་ན་འདོན་གྱི་བུ་ཡིན་ལ།
en: ‘This is the child of my family priest!

source: ང་འོངས་ན་བསུ་ཡང་མ་བསུ་ལངས་ཀྱང་མ་ལངས་ཀྱིས་འདིའི་མགོ་བོ་བཅད་དེ་བོར་རོ་
en: When I arrive, he does not receive me—he does not so much as stand! I shall have his head!’

source: སྙམ་དུ་བསམས་པ་དང་། རྒྱལ་པོ་དེའི་ལུས་ལས་འོད་འབྱུང་བ་དེ་དེས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་འོད་མེད་པར་གྱུར་ཏོ། །ས་ཡང་གས་ཏེ་དེར་ནུབ་ཏུ་བྱེད་པ་དང་
en: he thought, and no sooner had he thought this than the air of splendor surrounding the king’s body disappeared, and a fissure appeared in the earth and he began to sink into it.

source: དེ་མཐོང་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་འཇིགས་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: “Seeing this, the king was suddenly afraid.

source: དྲང་སྲོང་དེ་ལ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་ཡིན་ནོ་
en: ‘This sage is a person of great miracles and great power,’ he thought.

source: སྙམ་ནས་དགའ་བ་ཆེན་པོ་སྐྱེས་སོ། །དེ་ནས་དེས་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་བཟོད་པ་གསོལ་ཏོ། །
en: Reflecting on this, he was filled with great joy, and he bowed down at the sage’s feet and asked his forgiveness.

source: དེ་ནས་དྲང་སྲོང་གིས་སྨྲས་པ།
en: replied the sage,

source: རྒྱལ་པོ་ཆེན་པོ་
en: “ ‘Great King,’

source: ངས་ནི་བཟོད་མོད་ཀྱི་འོན་ཀྱང་རང་གི་སེམས་ལ་བཟོད་པ་གསོལ་ཅིག་ཅེས་བྱས་སོ། །
en: ‘though I forgive you, you must ask forgiveness of your own mind.’

source: དེ་ནས་རྒྱལ་པོ་སྐྲག་ནས་དྲང་སྲོང་དེ་ལ་སྨྲས་པ།
en: “In fear the king asked the sage,

source: དྲང་སྲོང་བདག་རྒྱལ་སྲིད་ལས་ཉམས་པའམ་སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་ལགས་གྲང་།
en: ‘But, sage, won’t my kingdom fall now? Won’t I lose my life?’

source: དྲང་སྲོང་གིས་སྨྲས་པ།
en: said the sage.

source: རྒྱལ་པོ་ཆེན་པོ་མ་སྐྲག་ཤིག །
en: “ ‘Never fear, Great King, never fear!’

source: དེ་ལྟ་མོད་ཀྱི་ཁྱོད་ཀྱིས་བདག་ལ་སེམས་སྡང་བར་བྱས་པ་དེས་ན་ཁྱོད་ཀྱི་འོད་དེ་མེད་པར་གྱུར་ལ་ས་ཡང་གས་པར་གྱུར་ཏོ། །
en: However, Great King, it is because of your spiteful thoughts toward me that your air of splendor disappeared and the earth cracked open.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སླར་བདག་ལ་དགའ་བའི་སེམས་བསྐྱེད་ན་ནི། ཁྱོད་ཀྱི་འོད་དེ་སླར་སྔ་མཁོ་བཞིན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: Great King, as soon as you again feel joy toward me, your air of splendor will return.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེས་དྲང་སྲོང་དེ་ལ་སེམས་དགའ་བ་སྐྱེས་ནས། དེའི་འོད་དེ་སྔ་མཁོ་བཞིན་དུ་བྱུང་བར་གྱུར་ལ། ས་ཡང་སླར་འབྱོར་བར་གྱུར་ཏོ། །
en: As soon as he heard this, the king felt joy toward the sage, and as soon as he felt this joy, his air of splendor returned and the crack in the earth closed up.

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་འདི་ཉིད་ཡིན་ནོ། །
en: The one who was the sage then is none other than Venerable Piṇḍola­bhāradvāja.

source: རྒྱལ་པོ་ལྷུན་པོར་གྱུར་པ་དེ་ནི་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was King Meru then is none other than King Udayin of Vatsa.

source: དེའི་ཚེ་ཡང་འདིས་དེ་ལ་སེམས་སྡང་བར་བྱས་པས་དེའི་འོད་ཀྱི་དཀྱིལ་འཁོར་མེད་པར་གྱུར་ལ་ས་ཡང་གས་པར་གྱུར་ཏོ། །གང་གི་ཚེ་ཕྱིར་སེམས་དགའ་བ་བསྐྱེད་པ་དེའི་ཚེ་ནི་འོད་ཀྱི་དཀྱིལ་འཁོར་དེ་ཡང་བྱུང་ལ། ས་གས་པ་ཡང་ཕྱིར་འབྱོར་བར་གྱུར་ཏོ། །
en: At that time, as soon as he had spiteful thoughts toward the elder monk, his air of splendor disappeared and the earth cracked open, and as soon as he felt joy toward him, his aura of splendor returned and the fissure in the earth closed up.

source: ད་ལྟར་ཡང་འདིས་དེ་ལ་སེམས་སྡང་བར་བྱས་པས་འདིའི་འོད་ཀྱང་མེད་པར་གྱུར་ལ་ས་ཡང་གས་སོ། །
en: And again, recently he had spiteful thoughts toward him, his splendor disappeared, and the earth cracked open.

source: གང་གི་ཚེ་འདིས་དེ་ལ་སེམས་དགའ་བ་བསྐྱེད་པ་དེའི་ཚེ་ནི་འདིའི་འོད་ཀྱི་དཀྱིལ་འཁོར་ཡང་བྱུང་བར་གྱུར་ལ་ས་གས་པ་ཡང་འབྱོར་བར་གྱུར་ཏོ།། །།
en: But no sooner did he feel joy toward him then his aura of splendor returned, and the crack in the earth closed up.”

source: རྒྱལ་མཚན་ཞེས་བྱ་བ་ནི།
en: Victory Banner

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: When the Blessed One was in Śrāvastī there was a king named Brahmadatta who reigned in the city of Vārāṇasī.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་
en: His kingdom was prosperous, flourishing, happy, and well populated. The harvest was good.

source: རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་ཆོམ་རྐུན་དང་མུ་གེ་དང་ནད་རྣམས་མེད་པ་དང་
en: Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་དེའི་བཙུན་མོ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་
en: One day the queen conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: བཙས་ནསདེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ།
en: At the elaborate feast celebrating her birth they asked,

source: བུ་མོ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དོ། །
en: “What name should we give this child?”

source: ཀཱ་ཤིའི་རྒྱལ་པོའི་བུ་མོ་ཡང་ཡིན་ལ་གཟུགས་ཀྱང་མཛེས་པས་ན། བུ་མོ་འདིའི་མིང་ཀཱ་ཤི་མཛེས་ལྡན་མ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named her, saying, “Since she is both the child of the king of Kāśi and very beautiful, her name will be Kāśisundarī (Beauty of Kāśi).”

source: དེ་ནས་བུ་མོ་ཀཱ་ཤི་མཛེས་ལྡན་མ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་། དྲི་མ་འཁྲུ་བའི་མ་མ་གཉིས་དང་། རྩེ་བའི་མ་མ་གཉིས་ཏེ་མ་མ་བརྒྱད་ལ་གཏད་ནས
en: Kāśisundarī had eight nurses—two nurses to hold her in their laps, two wet nurses, two nurses to bathe her, and two nurses to play with her.

source: དེ་མ་མ་བརྒྱད་ཀྱིས་འོ་མ་དང་ཞོ་དང་མར་དང་། ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: These eight nurses reared her on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་ཏེ། སྒྱུ་རྩལ་ཤེས་པར་གྱུར་པ་དེའི་ཚེ།
en: As she grew up she became versed in the arts.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་དེས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་བཀུར་སྟི་བྱས་སོ། །
en: She found faith in the doctrine of the Blessed One, and having asked for her parents’ permission, she offered her service to the Buddha, Dharma, and Saṅgha.

source: དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ།
en: When she had grown people said,

source: ཀཱ་ཤིའི་རྒྱལ་པོའི་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་ཡོད་དེ། འཇིག་རྟེན་ན་བུ་མོ་དེ་དང་འདྲ་བ་གཞན་མེད་དོ་ཞེས་ཀུན་ཏུ་གྲགས་པས་རྒྱས་པར་གྱུར་ཏོ། །
en: “This daughter of the king of Kāśi is well proportioned, pleasing to the eye, and beautiful—in all the world there’s none like her,” and her fame spread far and wide.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཉི་འོག་གི་རྒྱལ་པོ་དྲུག་འདོད་ཆགས་ཀྱི་མདས་ཕོག་ནས། དེ་དག་ཐམས་ཅད་ཀྱིས་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཕོ་ཉ་བཏང་སྟེ། དེ་དག་རེ་རེ་ནས་
en: Now there were six neighboring kings who were shot with arrows of lust upon hearing this, and they all sent envoys to Brahmadatta , the king of Kāśi, bearing the message,

source: བུ་མོ་དེ་ང་ལ་བྱིན་ཅིག་ཅེས་སྤྲིང་ངོ་། །
en: “Please give your daughter to me.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་ཚངས་པས་བྱིན་སེམས་ཁོངས་སུ་ཆུད་ཅིང་འདུག་སྟེ།
en: When he heard this, King Brahmadatta immediately sat and reflected.

source: གལ་ཏེ་བུ་མོ་འདི་གཅིག་ལ་བྱིན་ན་ནི།
en: “If I give my daughter to one of them,”

source: གཞན་རྣམས་བདག་གི་དགྲར་འགྱུར་ན་སུ་ལ་བྱིན་པར་བྱ་སྙམ་
en: he thought, “the others will become my enemies. To whom then should I give her?”

source: བསམས་ནས་གང་ལ་ཡང་སྦྱིན་མི་འདོད་པར་གྱུར་ཏོ། །
en: In light of this he did not want to give her to anyone.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཉི་འོག་གི་རྒྱལ་པོ་དྲུག་གིས་བསམས་པ།
en: One day the six neighboring kings thought,

source: དེས་བདག་ཅག་ལ་དད་པས་བུ་མོ་བྱིན་པར་མི་འགྱུར་གྱིས་དེར་སོང་ལ་མཐུས་དབྲོག་གོ་
en: “He will not give his daughter to any of us of his own free will. Therefore we must go and take her away by force.”

source: སྙམ་དུ་བསམས་ཏེཐམས་ཅད་ཀྱིས་ཉི་མ་གཅིག་ཏུ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་དོང་སྟེ། ཁོ་ར་ཁོར་ཡུག་ནས་བསྐོར་ཏོ། །
en: With this in mind, on the same day they all armored the four divisions of their armies and went to Vārāṇasī, where they surrounded the entire perimeter of the city.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བདག་ཉིད་ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་གཙེས་པར་རིག་ནས་ཁང་བཟངས་ཀྱི་སྟེང་དུ་སོང་སྟེ།
en: Then King Brahmadatta , realizing that the enemy armies were a threat to him, climbed to the roof of the palace.

source: ལག་པ་ལ་རྐོམ་ཚུགས་བཅས་ནས། ད་བདག་གིས་ཇི་ལྟར་བྱ་སྙམ་སྟེ་སེམས་ཁོངས་སུ་ཆུད་ཅིང་འདུག་གོ། །
en: There he sat and brooded with his cheek resting on his palm, wondering, “What shall I do now?”

source: དེ་ནས་ཀཱ་ཤི་མཛེས་ལྡན་མས་རྒྱལ་པོ་ཁང་བཟངས་ཀྱི་སྟེང་དུ་སོང་ནས་ལག་པ་ལ་རྐོམ་ཚུགས་བཅས་ཏེ་འདུག་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཕ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Kāśisundarī came to the roof of the palace, where she found her father sitting with his cheek resting on his palm, and asked him,

source: ཡབ་ཅིའི་སླད་དུ་ཁང་བཟངས་ཀྱི་སྟེང་དུ་གཤེགས་ནས། ཕྱག་ལ་རྐོམ་ཚུགས་བཅས་ཏེ་སེམས་ཁོངས་སུ་ཆུད་ཅིང་བཞུགས།
en: “Father, why have you come to the roof of the palace to brood with your cheek resting on your palm?”

source: བུ་མོ་ཁྱོད་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: “It is because of you, my child,”

source: བུ་མོས་སྨྲས་པ།
en: the young woman asked.

source: ཡབ་བདག་བྱད་བཞིན་ངན་ལགས་སམ་ཅི་ན་
en: “Is my appearance so poor, father?”

source: བདག་གི་སླད་དུ་ཡབ་སེམས་ཁོངས་སུ་ཆུད་ཅིང་བཞུགས།
en: “Why should my father sit and brood because of me?”

source: བུ་མོ་
en: “My child,”

source: ཁྱོད་ཡན་ལག་ཐམས་ཅད་མཛེས་པ་དང་ལྡན་པས། དེའི་ཕྱིར་ང་སེམས་ཁོངས་སུ་ཆུད་ཅིང་འདུག་སྟེ། ཁྱོད་ཉིད་ཀྱི་ཕྱིར་ཉི་འོག་གི་རྒྱལ་པོ་དྲུག་འཁྲུགས་ནས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ་ལྷགས་ནས་བ་ར་ཎཱ་སཱིར་བསྐོར་ཏེ་འཁོད་དོ། །
en: “it is because your every limb is endowed with beauty that I sit and brood, and it is because of you that the six quarreling neighboring kings have arrayed the four divisions of their armies and advanced on Vārāṇasī, surrounding the city in siege.”

source: ཡབ་བུ་མོ་དག་ལ་རང་ཉིད་ཀྱིས་ཁྱིམ་ཐབ་འདམ་པ་མ་མཆིས་ལགས་སམ།
en: “Can a daughter not choose a spouse for herself, father?”

source: བུ་མོ་འདམ་པ་ཡོད་དོ། །
en: “A daughter may choose,”

source: ཡབ་
en: “Father,”

source: བདག་ཉིད་ཀྱིས་ཁྱིམ་ཐབ་འདམ་པར་གནང་བར་མཛད་དུ་གསོལ།
en: “please permit me to choose my own spouse.”

source: ཁྱོད་ཉི་འོག་གི་རྒྱལ་པོ་རྣམས་ལ་ང་བཟླུགས་ཀྱི་བར་དུ་སྡོད་ཅིག་ཅེས་བྱས་ནས།
en: “please wait for me to inform the neighboring kings.”

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཉི་འོག་གི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ལ་བཟླུགས་ཏེ།
en: King Brahmadatta told the neighboring kings,

source: ཀཱ་ཤི་མཛེས་ལྡན་མ་ནི་རང་ཉིད་ཁྱིམ་ཐབ་འདམ་པར་ཆད་ཀྱིས་གལ་ཏེ་ཁྱེད་འདོད་ན་འདམ་དུ་གཞུག་གོ། །
en: “Kāśisundarī shall make her own choice regarding a spouse. Therefore I ask that you accept her decision.”

source: དེ་ནས་དེར་སོ་སོ་ནས་བསམས་པ་
en: At this they all thought,

source: དེ་ནི་ང་ལྟ་བུ་བཏང་སྟེ། གཞན་འདམ་པར་མི་འགྱུར་རོ་སྙམ་ནས་སྨྲས་པ།
en: “Kāśisundarī will not forsake one such as me to choose another,” and replied,

source: དེས་མ་ནོངས་ཀྱིས་འདམ་དུ་སྩོལ་ཅིག །
en: “She will not err—let her choose her husband!”

source: དེ་ནས་ཕོ་ཉ་དེ་ཕྱིར་སོང་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་བསྙད་དེ། དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: The envoys went and relayed this to King Brahmadatta , and he was very pleased to hear it.

source: རྒྱལ་པོ་དྲུག་པོ་དེ་དག་གིས་ཀྱང་གཅིག་ལ་གཅིག་བཟླུགས་ནས། ཡིད་ཆེས་པའི་མནའ་མཐོ་བཅད་དེ་
en: After he had replied to each in turn, they cut their thumbs and swore an oath.

source: མཇལ་དུམ་བྱས་ནས་ས་ཕྱོགས་གོ་སྐབས་ཡངས་པ་ཞིག་ཏུ་ཁང་པ་བརྩེགས་པ་ཚར་དུ་སྦྲེངས་ཏེ་རང་རང་གི་གཡོག་འཁོར་དང་རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་པའི་སེང་གེའི་ཁྲི་དག་ལ་འདུག་ཅིང་འཁོད་དོ། །
en: Then on a wide and suitable place, they all built multistory structures in a long row, in which each of them sat, surrounded by their retinues, on highly ornamented lion thrones.

source: ཀཱ་ཤི་མཛེས་ལྡན་མ་ཡང་བཞོན་པ་བཟང་པོ་ལ་ཞོན་ཏེ། བུ་མོ་དག་གིས་གཡོག་བྱས་ནས་ཆས་གོས་ཚོན་ཅན་གྱི་རྒྱལ་མཚན་བསྒྲེངས་ཏེ། བཱ་རཱ་ཎ་སཱི་ནས་བྱུང་ནས་དེ་དག་ཐམས་ཅད་ཀྱི་དབུས་ནས་ཐལ་ཏེ།
en: Kāśisundarī—astride a fine mount, attended by a band of young women, and hoisting a victory banner of colored cloth—emerged from Vārāṇasī into their midst.

source: དྲང་སྲོང་སྨྲ་བ་ལོགས་སུ་ཁ་བལྟས་ནས་བཅོམ་ལྡན་འདས་ལོགས་སུ་མེ་ཏོག་གི་ཆུན་པོ་བོར་ཏེ་སྨྲས་པ།
en: Then she faced Ṛṣivadana, cast her bridal bouquet in the direction of the Blessed One, and crying out,

source: བདག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ལ་སྐྱབས་སུ་མཆིའོ་ཞེས་བྱས་ནས། ཤིང་རྟ་དེ་དྲང་སྲོང་སྨྲ་བ་ལོགས་སུ་ཁ་བསྒྱུར་ཏོ། །
en: “I take refuge in the Blessed Buddha!” she oriented her chariot toward Ṛṣivadana.

source: དེ་ནས་རྒྱལ་པོ་དེ་དག་དང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ཡ་མཚན་དུ་གྱུར་ཏེ། འདི་འདི་ལྟར་བྱད་གཟུགས་མཛེས་ལ་འདོད་པ་རྣམས་ལ་ཡང་མི་ལྟ་བ་ངོ་མཚར་ཏོ་སྙམ་མོ། །དེ་ནས་དེ་དག་དེ་ཉིད་ཀྱི་ཕྱི་གཞིན་དུ་འབྲང་སྟེ་རེ་ཞིག་འདོང་ལ་
en: The kings and everyone in the great crowd realized to their astonishment that they had never seen so desirable a form as the fine one before them, and they trailed behind her, saying,

source: འདི་ཅི་བྱེད་པ་བལྟའོ་ཞེས་འཛེར་ཏོ། །
en: “Let’s see what she does!”
